function [itr] = interval(x, x1)
n = length(x); % количество начальных х  // 8
n1 = length(x1); % количество значейний функции // 6
itr = zeros(n1, 1); % матрица-столбец - n1 строчек, 1 столбец
k = 1; % ?
% x = [-5.5 -3.5 -1 2 4.5 5.5 6.8 7.7];
% x1 = [-10 -2 3.5 6.5 7.5 8]; 
% 0 2 4 6 7 8
% 6
for i = 1:n1 % для каждого из значейний функции 
    % i = 5
    if  (x1(i) < x(1)) % если i элемент зн.ф. <= н.х
        itr(i) = 0; 
    else
       % 7
       for j = k:n-1 % k = 6
           % j = 6
           if (x(j)<=x1(i) && x1(i)<=x(j+1)) 
               % x(j) < x1(i) < x(j+1)
               itr(i)= j;
               k = j;
           end   
       end
       if x1(i)>x(n) % если элемент зн.ф-ции больше последнего элемента х
           itr(i)=n;
       end
   end
end
end